Revit 2027 API
Ellipse.YDirection Property
The Y direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ YDirection { get; }
Public ReadOnly Property YDirection As XYZ
	Get
public:
property XYZ^ YDirection {
	XYZ^ get ();
}
member YDirection : XYZ with get
Property Value
XYZ
See Also
Reference
Ellipse Class
Autodesk.Revit.DB Namespace